Autodesk.Revit.UI.TextBox.EnterPressed
Subscribe to this event to be notified when the Enter button is pressed in the text box.

Autodesk.Revit.UI.TextBox.Width
Gets or sets the width of the TextBox.
Remarks: The value for this property must be positive and cannot be Infinity.
This value is interpreted in device-independent units (1/96th inch) measurement
device-independent units.
The default value is 200.
Since: 2011

Autodesk.Revit.UI.TextBox.ShowImageAsButton
Gets or sets a value that indicates if the Image set
in the text box should be displayed as a clickable button.
Remarks: If this property is true, the image will shown as a button inside the textbox.
Clicking this button will trigger the EnterPressed event. The default value
is false.
Since: 2011

Autodesk.Revit.UI.TextBox.Image
The image of the TextBox.
Remarks: The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.
Since: 2011

Autodesk.Revit.UI.TextBox.Value
The object that supplies the text value.
Remarks:
The value assigned to the TextBox can be a System.String or any other data type.
If the type is not a String the TextBox will display the return of the ToString() method.
When the text is edited in the UI, the type of Value will always be System.String.
Since: 2011

Autodesk.Revit.UI.TextBox.SelectTextOnFocus
A value that indicates if the text is selected when the text box gains focus.
Remarks: If the value is true all the text in the text box will be selected when the text box gets keyboard
focus. If it is false the text is not selected. The default value is false.
Since: 2011

Autodesk.Revit.UI.TextBox.PromptText
The prompt text for the text box.
Remarks: Prompt text is displayed when the text box is empty
and does not have keyboard focus. This text is displayed in italics. The default value is null.
Since: 2011

Autodesk.Revit.UI.TextBox
The TextBox object represents text-based control that allows the user to enter text.
Remarks: The ItemText property inherited from RibbonItem has no effect.
The text entered in the TextBox is edited by the UI user is accepted only if the user presses the Enter key or click the image button when ShowImageAsButton is true.
If the user clicks off of this component without pressing Enter or click the image button; then the text will be reverted to the previous value.
Use of this class is not supported in Revit Macros.
Since: 2011